export type Lesson = {
  id: number;
  name: string;
  imgPath: string;
  text: string;
  videoLink: string;
}

export const lessons: Lesson[] = [
  {
    id: 1,
    name: "Урок 1: Портретна зйомка",
    imgPath: "/assets/Lesson1.jpg",
    text: "Портретна фотографія — це мистецтво передавання характеру, емоцій і унікальності людини через знімок. Вона вимагає правильного вибору освітлення, фону та ракурсу, щоб підкреслити риси обличчя та створити гармонійний кадр. Важливу роль відіграє взаємодія фотографа з моделлю: комфортна атмосфера допомагає передати природні емоції та вирази. Використання різних технік, як-от розмиття фону (боке) або м’яке освітлення, додає знімку глибини та художнього ефекту. Портрети можуть бути студійними або знятими на вулиці, що відкриває безліч можливостей для творчості.",
    videoLink: "https://www.youtube.com/embed/qZUWdu2PnXg?si=YRR7wndGgHbUWXOf",
  },
  {
    id: 2,
    name: "Урок 2: Пейзаж",
    imgPath: "/assets/Lesson2.jpg",
    text: "Пейзажна фотографія — це мистецтво захоплення краси природи, міст або архітектури. Вона передбачає правильний вибір композиції, освітлення та кольорової гами. Важливу роль відіграють погодні умови та час зйомки, наприклад, золотий час перед заходом сонця додає теплих відтінків та глибини кадру. Використання ширококутного об’єктива, гра зі світлом та тінню допомагають створити захопливі знімки.",
    videoLink: "https://www.youtube.com/embed/chw8GxuW6N4?si=sy9qsqFWItkUoPaE",
  },
  {
    id: 3,
    name: "Урок 3: Макрозйомка",
    imgPath: "/assets/Lesson3.jpg",
    text: "Макрозйомка дозволяє побачити світ у деталях, що зазвичай не помітні неозброєним оком. Вона вимагає точного фокусування, стабільності камери та використання макрооб’єктива. Світло відіграє ключову роль, а правильний кут освітлення може підкреслити текстуру та глибину об’єкта.",
    videoLink: "https://www.youtube.com/embed/YTl9-VWe1xg?si=CwW1z1BgAn3yjJbs",
  },
  {
    id: 4,
    name: "Урок 4: Нічна зйомка",
    imgPath: "/assets/Lesson4.jpg",
    text: "Нічна фотографія відкриває унікальні можливості для творчості завдяки використанню довгої витримки, штатива та ігри зі світлом. Щоб отримати чіткі знімки без шуму, важливо вибирати низьке значення ISO, а для ефекту світлових слідів автомобілів — довгу витримку.",
    videoLink: "https://www.youtube.com/embed/BkjW0L5NBmE?si=IOvIMxVsGJRVFwVp",
  },
  {
    id: 5,
    name: "Урок 5: HDR",
    imgPath: "/assets/Lesson5.jpg",
    text: "HDR-фотографія (High Dynamic Range) допомагає отримати баланс між світлими та темними зонами знімка. Вона створюється шляхом об’єднання кількох кадрів з різною експозицією, що дозволяє уникнути пересвічення та надмірної тіні.",
    videoLink: "https://www.youtube.com/embed/vKHJdstcGVk?si=MbQbbTMQ5PV4q9Qx",
  },
];